#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: ae292556ed48a5ca89cf1d42ea492187.pdb
; shader hash: ae292556ed48a5ca89cf1d42ea492187
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: CSMain
;
;
; Buffer Definitions:
;
; cbuffer CB_Comp
; {
;
;   struct CB_Comp
;   {
;
;       float2 RenderSize;                            ; Offset:    0
;       uint Flags;                                   ; Offset:    8
;   
;   } CB_Comp;                                        ; Offset:    0 Size:    12
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB_Comp                           cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !30)
!1 = !DIFile(filename: "shaders\5Cfsrd_preprocess\5Cprecompile\5CFSRDOutputComp.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 38, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 38, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 32, type: !18, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 27, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 27, size: 96, align: 32, elements: !22, templateParams: !27)
!22 = !{!23, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, line: 27, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, line: 27, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !1, line: 27, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!28, !29}
!28 = !DITemplateTypeParameter(name: "element", type: !24)
!29 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!30 = !{!31, !40, !43, !47, !48, !50}
!31 = !DIGlobalVariable(name: "RenderSize", linkageName: "\01?RenderSize@CB_Comp@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 26, type: !32, isLocal: false, isDefinition: true)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 26, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 26, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!40 = !DIGlobalVariable(name: "Flags", linkageName: "\01?Flags@CB_Comp@@3IB", scope: !0, file: !1, line: 27, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 27, baseType: !24)
!43 = !DIGlobalVariable(name: "InDenoisedRadiance", linkageName: "\01?InDenoisedRadiance@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 17, type: !44, isLocal: false, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 17, size: 160, align: 32, elements: !2, templateParams: !45)
!45 = !{!46}
!46 = !DITemplateTypeParameter(name: "element", type: !5)
!47 = !DIGlobalVariable(name: "InSkipSignal", linkageName: "\01?InSkipSignal@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !44, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariable(name: "OutCompColor", linkageName: "\01?OutCompColor@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 20, type: !49, isLocal: false, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 20, size: 128, align: 32, elements: !2, templateParams: !45)
!50 = !DIGlobalVariable(name: "LinearSampler", linkageName: "\01?LinearSampler@@3USamplerState@@A", scope: !0, file: !1, line: 22, type: !51, isLocal: false, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 22, size: 32, align: 32, elements: !2)
!52 = !{i32 2, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{!"dxcoob 1.8.2502.11 (239921522)"}
!55 = !{!"shaders\5Cfsrd_preprocess\5Cprecompile\5CFSRDOutputComp.hlsl", !"// FSR-RR Conversion & Packing Shader\0D\0A#define THREAD_GROUP_SIZE_X 8\0D\0A#define THREAD_GROUP_SIZE_Y 8\0D\0A#define MainRS \5C\0D\0A    \22RootFlags(0), \22 \5C\0D\0A    \22CBV(b0), \22 \5C\0D\0A    \22DescriptorTable(SRV(t0, numDescriptors = 2), visibility = SHADER_VISIBILITY_ALL), \22 \5C\0D\0A    \22DescriptorTable(UAV(u0, numDescriptors = 1), visibility = SHADER_VISIBILITY_ALL), \22 \5C\0D\0A    \22StaticSampler(s0, \22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_MIP_LINEAR, \22 \5C\0D\0A        \22addressU = TEXTURE_ADDRESS_CLAMP, \22 \5C\0D\0A        \22addressV = TEXTURE_ADDRESS_CLAMP, \22 \5C\0D\0A        \22addressW = TEXTURE_ADDRESS_CLAMP, \22 \5C\0D\0A        \22visibility = SHADER_VISIBILITY_ALL)\22\0D\0A\0D\0A\0D\0ATexture2D<float4> InDenoisedRadiance : register(t0);\0D\0ATexture2D<float4> InSkipSignal : register(t1);\0D\0A\0D\0ARWTexture2D<float4> OutCompColor : register(u0);\0D\0A\0D\0ASamplerState LinearSampler : register(s0);\0D\0A\0D\0Acbuffer CB_Comp : register(b0)\0D\0A{\0D\0A    float2 RenderSize;\0D\0A    uint Flags;\0D\0A}\0D\0A\0D\0A[RootSignature(MainRS)]\0D\0A[numthreads(THREAD_GROUP_SIZE_X, THREAD_GROUP_SIZE_Y, 1)]\0D\0Avoid CSMain(uint3 id : SV_DispatchThreadID)\0D\0A{\0D\0A    if (id.x >= RenderSize.x || id.y >= RenderSize.y)\0D\0A        return;\0D\0A    \0D\0A    const float3 color = InDenoisedRadiance[id.xy].rgb;\0D\0A    OutCompColor[id.xy] = float4((color * color) + InSkipSignal[id.xy].rgb, 1.0f);\0D\0A\0D\0A}"}
!56 = !{!"shaders\5Cfsrd_preprocess\5Cprecompile\5CFSRDOutputComp.hlsl"}
!57 = !{!"-E", !"CSMain", !"-T", !"cs_6_0", !"/Fo", !"C:\5CUsers\5Czhemb\5Csource\5Crepos\5COptiScaler\5COptiScaler\5Cshaders\5Cfsrd_preprocess\5Cprecompile\5CFSRDOutputComp_Shader.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!58 = !{i32 1, i32 0}
!59 = !{i32 1, i32 8}
!60 = !{!"cs", i32 6, i32 0}
!61 = !{!62, !66, !68, null}
!62 = !{!63, !65}
!63 = !{i32 0, %"class.Texture2D<vector<float, 4> >"* undef, !"InDenoisedRadiance", i32 0, i32 0, i32 1, i32 2, i32 0, !64}
!64 = !{i32 0, i32 9}
!65 = !{i32 1, %"class.Texture2D<vector<float, 4> >"* undef, !"InSkipSignal", i32 0, i32 1, i32 1, i32 2, i32 0, !64}
!66 = !{!67}
!67 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* undef, !"OutCompColor", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !64}
!68 = !{!69}
!69 = !{i32 0, %CB_Comp* undef, !"CB_Comp", i32 0, i32 0, i32 1, i32 12, null}
!70 = !{i32 0, %CB_Comp undef, !71}
!71 = !{i32 12, !72, !73}
!72 = !{i32 6, !"RenderSize", i32 3, i32 0, i32 7, i32 9}
!73 = !{i32 6, !"Flags", i32 3, i32 8, i32 7, i32 5}
!74 = !{i32 1, void ()* @CSMain, !75}
!75 = !{!76}
!76 = !{i32 0, !2, !2}
!77 = !{void ()* @CSMain, !"CSMain", null, !61, !78}
!78 = !{i32 0, i64 1, i32 4, !79}
!79 = !{i32 8, i32 8, i32 1}
!80 = !DILocation(line: 38, column: 52, scope: !17)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "id", arg: 1, scope: !17, file: !1, line: 32, type: !20)
!82 = !DIExpression(DW_OP_bit_piece, 0, 32)
!83 = !DILocation(line: 32, column: 19, scope: !17)
!84 = !DIExpression(DW_OP_bit_piece, 32, 32)
!85 = !DILocation(line: 34, column: 9, scope: !86)
!86 = distinct !DILexicalBlock(scope: !17, file: !1, line: 34, column: 9)
!87 = !DILocation(line: 34, column: 17, scope: !86)
!88 = !DILocation(line: 34, column: 14, scope: !86)
!89 = !DILocation(line: 34, column: 30, scope: !86)
!90 = !DILocation(line: 34, column: 33, scope: !86)
!91 = !DILocation(line: 34, column: 41, scope: !86)
!92 = !DILocation(line: 34, column: 38, scope: !86)
!93 = !DILocation(line: 34, column: 9, scope: !17)
!94 = !DILocation(line: 35, column: 9, scope: !86)
!95 = !DILocation(line: 37, column: 26, scope: !17)
!96 = !DILocation(line: 37, column: 18, scope: !17)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !17, file: !1, line: 37, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 37, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 37, size: 96, align: 32, elements: !101, templateParams: !105)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !100, file: !1, line: 37, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !100, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !100, file: !1, line: 37, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!105 = !{!13, !29}
!106 = !DIExpression(DW_OP_bit_piece, 64, 32)
!107 = !DILocation(line: 38, column: 41, scope: !17)
!108 = !DILocation(line: 38, column: 50, scope: !17)
!109 = !DILocation(line: 38, column: 25, scope: !17)
!110 = !DILocation(line: 40, column: 1, scope: !17)

#endif

const unsigned char FSRDOutputComp_cso[] = {
  0x44, 0x58, 0x42, 0x43, 0x8e, 0x9d, 0x92, 0x66, 0xa0, 0x67, 0x9d, 0xe4,
  0xc4, 0xab, 0xcc, 0x6d, 0x16, 0x34, 0x9b, 0xd2, 0x01, 0x00, 0x00, 0x00,
  0xe4, 0x26, 0x00, 0x00, 0x0a, 0x00, 0x00, 0x00, 0x48, 0x00, 0x00, 0x00,
  0x58, 0x00, 0x00, 0x00, 0x68, 0x00, 0x00, 0x00, 0x78, 0x00, 0x00, 0x00,
  0x30, 0x01, 0x00, 0x00, 0xf4, 0x01, 0x00, 0x00, 0xe0, 0x17, 0x00, 0x00,
  0x20, 0x1f, 0x00, 0x00, 0x54, 0x1f, 0x00, 0x00, 0x70, 0x1f, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x49, 0x53, 0x47, 0x31, 0x08, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x4f, 0x53, 0x47, 0x31,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00,
  0x50, 0x53, 0x56, 0x30, 0xb0, 0x00, 0x00, 0x00, 0x34, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0xff,
  0x05, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x08, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x0d, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x06, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x43, 0x53, 0x4d, 0x61, 0x69, 0x6e, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x54, 0x53, 0x30, 0xbc, 0x00, 0x00, 0x00,
  0x02, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0x88, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x48, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x68, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0x50, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0xff, 0x01, 0x00, 0x00, 0x00,
  0x70, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0xff, 0xff, 0xff, 0xff, 0x15, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0xff, 0xff, 0x7f, 0x7f, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x49, 0x4c, 0x44, 0x42,
  0xe4, 0x15, 0x00, 0x00, 0x60, 0x00, 0x05, 0x00, 0x79, 0x05, 0x00, 0x00,
  0x44, 0x58, 0x49, 0x4c, 0x00, 0x01, 0x00, 0x00, 0x10, 0x00, 0x00, 0x00,
  0xcc, 0x15, 0x00, 0x00, 0x42, 0x43, 0xc0, 0xde, 0x21, 0x0c, 0x00, 0x00,
  0x70, 0x05, 0x00, 0x00, 0x0b, 0x82, 0x20, 0x00, 0x02, 0x00, 0x00, 0x00,
  0x13, 0x00, 0x00, 0x00, 0x07, 0x81, 0x23, 0x91, 0x41, 0xc8, 0x04, 0x49,
