#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: b791e1df4260b68c5f6fce1437e3f9d9.pdb
; shader hash: b791e1df4260b68c5f6fce1437e3f9d9
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: CSMain
;
;
; Buffer Definitions:
;
; cbuffer CB_Packing
; {
;
;   struct hostlayout.CB_Packing
;   {
;
;       column_major float4x4 InvViewMatrix;          ; Offset:    0
;       column_major float4x4 InvProjMatrix;          ; Offset:   64
;       column_major float4x4 InvViewProjMatrix;      ; Offset:  128
;       column_major float4x4 PrevViewMatrix;         ; Offset:  192
;       float2 RenderSize;                            ; Offset:  256
;       float2 RenderSizeInv;                         ; Offset:  264
;       float NearPlane;                              ; Offset:  272

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !38, globals: !117)
!1 = !DIFile(filename: "shaders\5Cfsrd_preprocess\5Cprecompile\5CFSRDInputConv.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !21, !29}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 253, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 253, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 253, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 253, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 71, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 71, size: 64, align: 32, elements: !15, templateParams: !19)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 71, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 71, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !17)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 259, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 259, size: 96, align: 32, elements: !23, templateParams: !27)
!23 = !{!24, !25, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, line: 259, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, line: 259, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !22, file: !1, line: 259, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!20, !28}
!28 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 269, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 269, size: 128, align: 32, elements: !31, templateParams: !36)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 269, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 269, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 269, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !30, file: !1, line: 269, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!36 = !{!20, !37}
!37 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!38 = !{!39, !51, !54, !79, !90, !91, !96, !99, !102, !105, !108, !111, !114}
!39 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 248, type: !40, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 86, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 86, size: 96, align: 32, elements: !44, templateParams: !49)
!44 = !{!45, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !1, line: 86, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !1, line: 86, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !43, file: !1, line: 86, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !{!50, !28}
!50 = !DITemplateTypeParameter(name: "element", type: !46)
!51 = !DISubprogram(name: "UVToNDC", linkageName: "\01?UVToNDC@@YA?AV?$vector@M$01@@V1@@Z", scope: !1, file: !1, line: 119, type: !52, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!13, !13}
!54 = !DISubprogram(name: "InvProjectPosition", linkageName: "\01?InvProjectPosition@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$03@@@Z", scope: !1, file: !1, line: 126, type: !55, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!21, !21, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 75, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 75, size: 512, align: 32, elements: !59, templateParams: !76)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !58, file: !1, line: 75, baseType: !17, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!76 = !{!20, !77, !78}
!77 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!78 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!79 = !DISubprogram(name: "AnalyzeRadiance", linkageName: "\01?AnalyzeRadiance@@YA?AV?$vector@M$01@@V?$vector@I$01@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 202, type: !80, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubroutineType(types: !81)
!81 = !{!13, !82, !89}
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 133, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 133, size: 64, align: 32, elements: !85, templateParams: !88)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !84, file: !1, line: 133, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !84, file: !1, line: 133, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!88 = !{!50, !12}
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!90 = !DISubprogram(name: "SafeNormalize", linkageName: "\01?SafeNormalize@@YA?AV?$vector@M$01@@V1@@Z", scope: !1, file: !1, line: 196, type: !52, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubprogram(name: "IsSet", linkageName: "\01?IsSet@@YA_NI@Z", scope: !1, file: !1, line: 89, type: !92, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !95}
!94 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 86, baseType: !46)
!96 = !DISubprogram(name: "OctahedralEncode", linkageName: "\01?OctahedralEncode@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 93, type: !97, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!13, !21}
!99 = !DISubprogram(name: "EstimateMetalness", linkageName: "\01?EstimateMetalness@@YAMV?$vector@M$02@@0@Z", scope: !1, file: !1, line: 136, type: !100, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!17, !21, !21}
!102 = !DISubprogram(name: "GetDebugMode", linkageName: "\01?GetDebugMode@@YAIXZ", scope: !1, file: !1, line: 90, type: !103, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{!95}
!105 = !DISubprogram(name: "TurboColormap", linkageName: "\01?TurboColormap@@YA?AV?$vector@M$02@@M@Z", scope: !1, file: !1, line: 156, type: !106, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubroutineType(types: !107)
!107 = !{!21, !17}
!108 = !DISubprogram(name: "VisualizeMotionVec", linkageName: "\01?VisualizeMotionVec@@YA?AV?$vector@M$02@@V?$vector@M$01@@M@Z", scope: !1, file: !1, line: 179, type: !109, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!21, !13, !17}
!111 = !DISubprogram(name: "VisualizeSignedDiff", linkageName: "\01?VisualizeSignedDiff@@YA?AV?$vector@M$02@@MM@Z", scope: !1, file: !1, line: 189, type: !112, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false)
!112 = !DISubroutineType(types: !113)
!113 = !{!21, !17, !17}
!114 = !DISubprogram(name: "OctahedralDecode", linkageName: "\01?OctahedralDecode@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 107, type: !115, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false)
!115 = !DISubroutineType(types: !116)
!116 = !{!21, !13}
!117 = !{!118, !120, !121, !122, !123, !125, !126, !128, !129, !131, !132, !136, !139, !143, !144, !145, !146, !147, !148, !150, !151, !152, !153, !154, !155, !157, !158, !160, !161, !162, !163, !164, !165, !169}
!118 = !DIGlobalVariable(name: "InvViewMatrix", linkageName: "\01?InvViewMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 75, type: !119, isLocal: false, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!120 = !DIGlobalVariable(name: "InvProjMatrix", linkageName: "\01?InvProjMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 76, type: !119, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "InvViewProjMatrix", linkageName: "\01?InvViewProjMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 77, type: !119, isLocal: false, isDefinition: true)
