#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 6d4f23b7114c09a9be0edbf2f232c176.pdb
; shader hash: 6d4f23b7114c09a9be0edbf2f232c176
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: CSMain
;
;
; Buffer Definitions:
;
; cbuffer CB_Comp
; {
;
;   struct CB_Comp
;   {
;
;       float4 DstTexSize;                            ; Offset:    0
;       uint Flags;                                   ; Offset:   16
;   
;   } CB_Comp;                                        ; Offset:    0 Size:    20
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB_Comp                           cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !42)
!1 = !DIFile(filename: "shaders\5Cfsrd_preprocess\5Cprecompile\5CFSRDOutputComp.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 52, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 52, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 52, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 30, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 30, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 30, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !{!24, !37}
!24 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 38, type: !25, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 31, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 31, size: 96, align: 32, elements: !29, templateParams: !34)
!29 = !{!30, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, line: 31, baseType: !31, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, line: 31, baseType: !31, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !1, line: 31, baseType: !31, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!34 = !{!35, !36}
!35 = !DITemplateTypeParameter(name: "element", type: !31)
!36 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!37 = !DISubprogram(name: "IsSet", linkageName: "\01?IsSet@@YA_NI@Z", scope: !1, file: !1, line: 34, type: !38, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 31, baseType: !31)
!42 = !{!43, !45, !47, !51, !52, !62, !63, !65}
!43 = !DIGlobalVariable(name: "DstTexSize", linkageName: "\01?DstTexSize@CB_Comp@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 30, type: !44, isLocal: false, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!45 = !DIGlobalVariable(name: "Flags", linkageName: "\01?Flags@CB_Comp@@3IB", scope: !0, file: !1, line: 31, type: !46, isLocal: false, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!47 = !DIGlobalVariable(name: "InPrimaryColor", linkageName: "\01?InPrimaryColor@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 19, type: !48, isLocal: false, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 19, size: 160, align: 32, elements: !2, templateParams: !49)
!49 = !{!50}
!50 = !DITemplateTypeParameter(name: "element", type: !15)
!51 = !DIGlobalVariable(name: "InFusedModulator", linkageName: "\01?InFusedModulator@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 20, type: !48, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariable(name: "InColorBeforeParticles", linkageName: "\01?InColorBeforeParticles@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 21, type: !53, isLocal: false, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 21, size: 128, align: 32, elements: !2, templateParams: !54)
!54 = !{!55}
!55 = !DITemplateTypeParameter(name: "element", type: !56)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 63, size: 96, align: 32, elements: !57, templateParams: !61)
!57 = !{!58, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !1, line: 63, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !56, file: !1, line: 63, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!61 = !{!11, !36}
!62 = !DIGlobalVariable(name: "InSkipSignal", linkageName: "\01?InSkipSignal@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !48, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariable(name: "OutColor", linkageName: "\01?OutColor@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 24, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 24, size: 128, align: 32, elements: !2, templateParams: !49)
!65 = !DIGlobalVariable(name: "LinearSampler", linkageName: "\01?LinearSampler@@3USamplerState@@A", scope: !0, file: !1, line: 26, type: !66, isLocal: false, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 26, size: 32, align: 32, elements: !2)
!67 = !{i32 2, !"Dwarf Version", i32 4}
!68 = !{i32 2, !"Debug Info Version", i32 3}
!69 = !{!"dxcoob 1.8.2502.11 (239921522)"}
