#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: c79ed1c81ea8431c966d1b9e51b76e8c.pdb
; shader hash: c79ed1c81ea8431c966d1b9e51b76e8c
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: CSMain
;
;
; Buffer Definitions:
;
; cbuffer CB_Packing
; {
;
;   struct hostlayout.CB_Packing
;   {
;
;       column_major float4x4 InvViewMatrix;          ; Offset:    0
;       column_major float4x4 InvProjMatrix;          ; Offset:   64
;       column_major float4x4 InvViewProjMatrix;      ; Offset:  128
;       column_major float4x4 PrevViewMatrix;         ; Offset:  192
;       float2 RenderSize;                            ; Offset:  256
;       float2 RenderSizeInv;                         ; Offset:  264
;       float UseSqrtEncodingOnSecondaries;           ; Offset:  272

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !38, globals: !85)
!1 = !DIFile(filename: "shaders\5Cfsrd_input_conv\5Cprecompile\5CFSRDInputConv.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !21, !29}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 110, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 110, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 110, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 110, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 46, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 46, size: 64, align: 32, elements: !15, templateParams: !19)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 46, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 46, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !17)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 116, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 116, size: 96, align: 32, elements: !23, templateParams: !27)
!23 = !{!24, !25, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, line: 116, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, line: 116, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !22, file: !1, line: 116, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!20, !28}
!28 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 125, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 125, size: 128, align: 32, elements: !31, templateParams: !36)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 125, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 125, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 125, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !30, file: !1, line: 125, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!36 = !{!20, !37}
!37 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!38 = !{!39, !51, !54, !79, !82}
!39 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 105, type: !40, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 54, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 54, size: 96, align: 32, elements: !44, templateParams: !49)
!44 = !{!45, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !1, line: 54, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !1, line: 54, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !43, file: !1, line: 54, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !{!50, !28}
!50 = !DITemplateTypeParameter(name: "element", type: !46)
!51 = !DISubprogram(name: "UVToNDC", linkageName: "\01?UVToNDC@@YA?AV?$vector@M$01@@V1@@Z", scope: !1, file: !1, line: 69, type: !52, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!13, !13}
!54 = !DISubprogram(name: "InvProjectPosition", linkageName: "\01?InvProjectPosition@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$03@@@Z", scope: !1, file: !1, line: 76, type: !55, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!21, !21, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 41, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 41, size: 512, align: 32, elements: !59, templateParams: !76)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !58, file: !1, line: 41, baseType: !17, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!76 = !{!20, !77, !78}
!77 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!78 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!79 = !DISubprogram(name: "OctahedralEncode", linkageName: "\01?OctahedralEncode@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 60, type: !80, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubroutineType(types: !81)
!81 = !{!13, !21}
!82 = !DISubprogram(name: "EstimateMetalness", linkageName: "\01?EstimateMetalness@@YAMV?$vector@M$02@@0@Z", scope: !1, file: !1, line: 86, type: !83, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!17, !21, !21}
!85 = !{!86, !88, !89, !90, !91, !93, !94, !96, !97, !98, !99, !100, !101, !105, !108, !112, !113, !114, !115, !116, !117, !119, !120, !121, !122, !123, !124, !126}
!86 = !DIGlobalVariable(name: "InvViewMatrix", linkageName: "\01?InvViewMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 41, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!88 = !DIGlobalVariable(name: "InvProjMatrix", linkageName: "\01?InvProjMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 42, type: !87, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "InvViewProjMatrix", linkageName: "\01?InvViewProjMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 43, type: !87, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "PrevViewMatrix", linkageName: "\01?PrevViewMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 44, type: !87, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "RenderSize", linkageName: "\01?RenderSize@CB_Packing@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 46, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!93 = !DIGlobalVariable(name: "RenderSizeInv", linkageName: "\01?RenderSizeInv@CB_Packing@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 47, type: !92, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "UseSqrtEncodingOnSecondaries", linkageName: "\01?UseSqrtEncodingOnSecondaries@CB_Packing@@3MB", scope: !0, file: !1, line: 49, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!96 = !DIGlobalVariable(name: "NearPlane", linkageName: "\01?NearPlane@CB_Packing@@3MB", scope: !0, file: !1, line: 50, type: !95, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariable(name: "FarPlane", linkageName: "\01?FarPlane@CB_Packing@@3MB", scope: !0, file: !1, line: 51, type: !95, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "UseInfiniteFarPlane", linkageName: "\01?UseInfiniteFarPlane@CB_Packing@@3MB", scope: !0, file: !1, line: 52, type: !95, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "IsRoughnessPacked", linkageName: "\01?IsRoughnessPacked@CB_Packing@@3MB", scope: !0, file: !1, line: 54, type: !95, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariable(name: "materialType", scope: !39, file: !1, line: 139, type: !95, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariable(name: "InColor", linkageName: "\01?InColor@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 17, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 17, size: 160, align: 32, elements: !2, templateParams: !103)
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "element", type: !30)
