#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: bcf094399ed23fd4ef6891f4a3ebf9bf.pdb
; shader hash: bcf094399ed23fd4ef6891f4a3ebf9bf
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: CSMain
;
;
; Buffer Definitions:
;
; cbuffer CB_Packing
; {
;
;   struct hostlayout.CB_Packing
;   {
;
;       column_major float4x4 InvViewMatrix;          ; Offset:    0
;       column_major float4x4 InvProjMatrix;          ; Offset:   64
;       column_major float4x4 InvViewProjMatrix;      ; Offset:  128
;       column_major float4x4 PrevViewMatrix;         ; Offset:  192
;       float2 RenderSize;                            ; Offset:  256
;       float2 RenderSizeInv;                         ; Offset:  264
;       float NearPlane;                              ; Offset:  272

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !38, globals: !105)
!1 = !DIFile(filename: "shaders\5Cfsrd_input_conv\5Cprecompile\5CFSRDInputConv.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !21, !30}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 204, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 204, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 204, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 204, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 77, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 77, size: 64, align: 32, elements: !15, templateParams: !19)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 77, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 77, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !17)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 211, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 211, size: 128, align: 32, elements: !23, templateParams: !28)
!23 = !{!24, !25, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, line: 211, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, line: 211, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !22, file: !1, line: 211, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !22, file: !1, line: 211, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!28 = !{!20, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 225, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 225, size: 96, align: 32, elements: !32, templateParams: !36)
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 225, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 225, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 225, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !{!20, !37}
!37 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!38 = !{!39, !51, !54, !59, !62, !87, !90, !93, !96, !99, !102}
!39 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 199, type: !40, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 83, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 83, size: 96, align: 32, elements: !44, templateParams: !49)
!44 = !{!45, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !1, line: 83, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !1, line: 83, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !43, file: !1, line: 83, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !{!50, !37}
!50 = !DITemplateTypeParameter(name: "element", type: !46)
!51 = !DISubprogram(name: "OctahedralEncode", linkageName: "\01?OctahedralEncode@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 92, type: !52, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!13, !30}
!54 = !DISubprogram(name: "IsSet", linkageName: "\01?IsSet@@YA_NI@Z", scope: !1, file: !1, line: 88, type: !55, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !58}
!57 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 83, baseType: !46)
!59 = !DISubprogram(name: "UVToNDC", linkageName: "\01?UVToNDC@@YA?AV?$vector@M$01@@V1@@Z", scope: !1, file: !1, line: 118, type: !60, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!13, !13}
!62 = !DISubprogram(name: "InvProjectPosition", linkageName: "\01?InvProjectPosition@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$03@@@Z", scope: !1, file: !1, line: 125, type: !63, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!30, !30, !65}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 72, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 72, size: 512, align: 32, elements: !67, templateParams: !84)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !66, file: !1, line: 72, baseType: !17, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!84 = !{!20, !85, !86}
!85 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!86 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!87 = !DISubprogram(name: "EstimateMetalness", linkageName: "\01?EstimateMetalness@@YAMV?$vector@M$02@@0@Z", scope: !1, file: !1, line: 135, type: !88, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!17, !30, !30}
!90 = !DISubprogram(name: "GetDebugMode", linkageName: "\01?GetDebugMode@@YAIXZ", scope: !1, file: !1, line: 89, type: !91, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!58}
!93 = !DISubprogram(name: "TurboColormap", linkageName: "\01?TurboColormap@@YA?AV?$vector@M$02@@M@Z", scope: !1, file: !1, line: 155, type: !94, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!30, !17}
!96 = !DISubprogram(name: "VisualizeMotionVec", linkageName: "\01?VisualizeMotionVec@@YA?AV?$vector@M$02@@V?$vector@M$01@@M@Z", scope: !1, file: !1, line: 178, type: !97, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!30, !13, !17}
!99 = !DISubprogram(name: "VisualizeSignedDiff", linkageName: "\01?VisualizeSignedDiff@@YA?AV?$vector@M$02@@MM@Z", scope: !1, file: !1, line: 188, type: !100, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!30, !17, !17}
!102 = !DISubprogram(name: "OctahedralDecode", linkageName: "\01?OctahedralDecode@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 106, type: !103, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{!30, !13}
!105 = !{!106, !108, !109, !110, !111, !113, !114, !116, !117, !119, !120, !124, !127, !131, !132, !133, !134, !135, !136, !138, !139, !140, !141, !142, !143, !145, !147, !149, !150, !151, !152, !153}
!106 = !DIGlobalVariable(name: "InvViewMatrix", linkageName: "\01?InvViewMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 72, type: !107, isLocal: false, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!108 = !DIGlobalVariable(name: "InvProjMatrix", linkageName: "\01?InvProjMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 73, type: !107, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "InvViewProjMatrix", linkageName: "\01?InvViewProjMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 74, type: !107, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "PrevViewMatrix", linkageName: "\01?PrevViewMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 75, type: !107, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "RenderSize", linkageName: "\01?RenderSize@CB_Packing@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 77, type: !112, isLocal: false, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!113 = !DIGlobalVariable(name: "RenderSizeInv", linkageName: "\01?RenderSizeInv@CB_Packing@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 78, type: !112, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariable(name: "NearPlane", linkageName: "\01?NearPlane@CB_Packing@@3MB", scope: !0, file: !1, line: 80, type: !115, isLocal: false, isDefinition: true)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
