#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 2ed3f7f5a21d818edf158bd93c54f669.pdb
; shader hash: 2ed3f7f5a21d818edf158bd93c54f669
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Compute Shader
; NumThreads=(8,8,1)
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 0
; SigOutputElements: 0
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 0
; SigOutputVectors[0]: 0
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: CSMain
;
;
; Buffer Definitions:
;
; cbuffer CB_Packing
; {
;
;   struct hostlayout.CB_Packing
;   {
;
;       column_major float4x4 InvViewMatrix;          ; Offset:    0
;       column_major float4x4 InvProjMatrix;          ; Offset:   64
;       column_major float4x4 InvViewProjMatrix;      ; Offset:  128
;       column_major float4x4 PrevViewMatrix;         ; Offset:  192
;       float2 RenderSize;                            ; Offset:  256
;       float2 RenderSizeInv;                         ; Offset:  264
;       float NearPlane;                              ; Offset:  272

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !38, globals: !105)
!1 = !DIFile(filename: "shaders\5Cfsrd_input_conv\5Cprecompile\5CFSRDInputConv.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !21, !29}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 206, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 206, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 206, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 206, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 79, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 79, size: 64, align: 32, elements: !15, templateParams: !19)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 79, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 79, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !17)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 212, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 212, size: 96, align: 32, elements: !23, templateParams: !27)
!23 = !{!24, !25, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, line: 212, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, line: 212, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !22, file: !1, line: 212, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!20, !28}
!28 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 228, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 228, size: 128, align: 32, elements: !31, templateParams: !36)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 228, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 228, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 228, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !30, file: !1, line: 228, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!36 = !{!20, !37}
!37 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!38 = !{!39, !51, !54, !79, !84, !87, !90, !93, !96, !99, !102}
!39 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 201, type: !40, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 85, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 85, size: 96, align: 32, elements: !44, templateParams: !49)
!44 = !{!45, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !1, line: 85, baseType: !46, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !1, line: 85, baseType: !46, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !43, file: !1, line: 85, baseType: !46, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !{!50, !28}
!50 = !DITemplateTypeParameter(name: "element", type: !46)
!51 = !DISubprogram(name: "UVToNDC", linkageName: "\01?UVToNDC@@YA?AV?$vector@M$01@@V1@@Z", scope: !1, file: !1, line: 120, type: !52, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!13, !13}
!54 = !DISubprogram(name: "InvProjectPosition", linkageName: "\01?InvProjectPosition@@YA?AV?$vector@M$02@@V1@V?$matrix@M$03$03@@@Z", scope: !1, file: !1, line: 127, type: !55, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!21, !21, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 74, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 74, size: 512, align: 32, elements: !59, templateParams: !76)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !58, file: !1, line: 74, baseType: !17, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!76 = !{!20, !77, !78}
!77 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!78 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!79 = !DISubprogram(name: "IsSet", linkageName: "\01?IsSet@@YA_NI@Z", scope: !1, file: !1, line: 90, type: !80, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !83}
!82 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 85, baseType: !46)
!84 = !DISubprogram(name: "OctahedralEncode", linkageName: "\01?OctahedralEncode@@YA?AV?$vector@M$01@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 94, type: !85, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!13, !21}
!87 = !DISubprogram(name: "EstimateMetalness", linkageName: "\01?EstimateMetalness@@YAMV?$vector@M$02@@0@Z", scope: !1, file: !1, line: 137, type: !88, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!17, !21, !21}
!90 = !DISubprogram(name: "GetDebugMode", linkageName: "\01?GetDebugMode@@YAIXZ", scope: !1, file: !1, line: 91, type: !91, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!83}
!93 = !DISubprogram(name: "TurboColormap", linkageName: "\01?TurboColormap@@YA?AV?$vector@M$02@@M@Z", scope: !1, file: !1, line: 157, type: !94, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false)
!94 = !DISubroutineType(types: !95)
!95 = !{!21, !17}
!96 = !DISubprogram(name: "VisualizeMotionVec", linkageName: "\01?VisualizeMotionVec@@YA?AV?$vector@M$02@@V?$vector@M$01@@M@Z", scope: !1, file: !1, line: 180, type: !97, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!21, !13, !17}
!99 = !DISubprogram(name: "VisualizeSignedDiff", linkageName: "\01?VisualizeSignedDiff@@YA?AV?$vector@M$02@@MM@Z", scope: !1, file: !1, line: 190, type: !100, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{!21, !17, !17}
!102 = !DISubprogram(name: "OctahedralDecode", linkageName: "\01?OctahedralDecode@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 108, type: !103, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{!21, !13}
!105 = !{!106, !108, !109, !110, !111, !113, !114, !116, !117, !119, !120, !124, !127, !131, !132, !133, !134, !135, !136, !138, !139, !140, !141, !142, !143, !145, !146, !148, !150, !151, !152, !153, !154}
!106 = !DIGlobalVariable(name: "InvViewMatrix", linkageName: "\01?InvViewMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 74, type: !107, isLocal: false, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!108 = !DIGlobalVariable(name: "InvProjMatrix", linkageName: "\01?InvProjMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 75, type: !107, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "InvViewProjMatrix", linkageName: "\01?InvViewProjMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 76, type: !107, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "PrevViewMatrix", linkageName: "\01?PrevViewMatrix@CB_Packing@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 77, type: !107, isLocal: false, isDefinition: true)
